Documents/ESB/ESB_Consumer_1023/003TestSample/SAMPLE_XML_MUST/Wallet/WA01_WalletProfInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Wallet/WalletProfInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Wallet</ServiceDomain>  
      <OperationName>WalletProfInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:WalletProfInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>WA01</v11:TxnId>  
        <v11:TxnNo>WA0100001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:InqPageNo>1</v11:InqPageNo>  
        <v11:NoOfPage>200</v11:NoOfPage>  
        <v11:CardNo>1111222233334444</v11:CardNo>  
        <v11:WalletCardType>1</v11:WalletCardType> 
      </v11:ServiceBody> 
    </v11:WalletProfInqRq> 
  </soap:Body> 
</soap:Envelope>
